--事务
  --开启一个事务 start transaction或者begin
    start transaction
    update goods_update set name="小霸王游戏机" where id=16;
mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)
mysql> update goods_update set name="小霸王游戏机" where id=16;
Query OK, 1 row affected (0.00 sec)
Rows matched: 1  Changed: 1  Warnings: 0
---使用Navicat查询
9	E550cc 15.6英寸笔记本	5	2	2799	1	0
10	x260 超级本	7	1	4880	1	0
11	电脑背包	6	1	98	1	0
12	键盘	6	3	210	1	0
13	鼠标	6	3	180	1	0
14	商务笔记本	6	3	210	1	0
15	游戏笔记本	6	3	180	1	0
16	小霸王学习机	6	2	299	1	0
--dos执行commit

mysql> commit;
Query OK, 0 rows affected (0.01 sec)
mysql> commit;
Query OK, 0 rows affected (0.01 sec)

mysql> select * from goods_update;
+----+-----------------------+---------+----------+----------+---------+------------+
| id | name                  | cate_id | brand_id | price    | is_show | is_saleoff |
+----+-----------------------+---------+----------+----------+---------+------------+
|  1 | r510vc 15.6英寸笔记本 |       5 |        2 | 3399.000 |        |            |
|  2 | y400n 14.0英寸笔记本  |       5 |        1 | 5000.000 |        |            |
|  3 | g150th 15.6英寸游戏本 |       4 |        3 | 8499.000 |        |            |
|  4 | x550cc 15.6英寸笔记本 |       5 |        2 | 2799.000 |        |            |
|  5 | x240 超级本           |       7 |        1 | 6000.000 |        |            |
|  6 | r520vc 15.6英寸笔记本 |       5 |        2 | 3399.000 |        |            |
|  7 | y410n 14.0英寸笔记本  |       5 |        1 | 4999.000 |        |            |
|  8 | g160th 15.6英寸游戏本 |       4 |        3 | 8500.000 |        |            |
|  9 | E550cc 15.6英寸笔记本 |       5 |        2 | 2799.000 |        |            |
| 10 | x260 超级本           |       7 |        1 | 4880.000 |        |            |
| 11 | 电脑背包              |       6 |        1 |   98.000 |        |            |
| 12 | 键盘                  |       6 |        3 |  210.000 |        |            |
| 13 | 鼠标                  |       6 |        3 |  180.000 |        |            |
| 14 | 商务笔记本            |       6 |        3 |  210.000 |        |            |
| 15 | 游戏笔记本            |       6 |        3 |  180.000 |        |            |
| 16 | 小霸王游戏机          |       6 |        2 |  299.000 |        |            |
+----+-----------------------+---------+----------+----------+---------+------------+