--自关联
  --查询吉林省有多少个地级市
  mysql> select * from province where pid=88;
+-----+------------------+------+
| aid | atitle           | pid  |
+-----+------------------+------+
| 235 | 长春市           |   88 |
| 236 | 吉林市           |   88 |
| 237 | 四平市           |   88 |
| 238 | 辽源市           |   88 |
| 239 | 通化市           |   88 |
| 240 | 白山市           |   88 |
| 241 | 延边朝鲜族自治州 |   88 |
| 242 | 白城市           |   88 |
| 243 | 松原市           |   88 |
+-----+------------------+------+
  --查询长春市下的区县
  mysql> select * from province where pid=235;
+-----+--------+------+
| aid | atitle | pid  |
+-----+--------+------+
| 841 | 南关区 |  235 |
| 842 | 朝阳区 |  235 |
| 843 | 绿园区 |  235 |
| 844 | 农安县 |  235 |
| 845 | 榆树市 |  235 |
| 846 | 德惠市 |  235 |
| 847 | 宽城区 |  235 |
| 848 | 二道区 |  235 |
| 849 | 双阳区 |  235 |
| 850 | 九台市 |  235 |
+-----+--------+------+
  --2查询吉林省的地级市
  select p.atitle,c.atitle from province as p inner join province as c on p.aid=c.pid having p.atitle="吉林省";

mysql> select p.atitle as 省份,c.atitle as 市 from province as p inner join province as c on p.aid=c.pid having p.atitle="吉林省";
+--------+------------------+
| 省份   | 市              |
+--------+------------------+
| 吉林省 | 长春市           |
| 吉林省 | 吉林市           |
| 吉林省 | 四平市           |
| 吉林省 | 辽源市           |
| 吉林省 | 通化市           |
| 吉林省 | 白山市           |
| 吉林省 | 延边朝鲜族自治州 |
| 吉林省 | 白城市           |
| 吉林省 | 松原市           |
+--------+------------------+
  --2查询长春市的区
  mysql> select p.atitle as 省份,c.atitle as 区 from province as p inner join province as c on p.aid=c.pid having p.atitle="长春市";
+--------+--------+
| 省份   | 区     |
+--------+--------+
| 长春市 | 南关区 |
| 长春市 | 朝阳区 |
| 长春市 | 绿园区 |
| 长春市 | 农安县 |
| 长春市 | 榆树市 |
| 长春市 | 德惠市 |
| 长春市 | 宽城区 |
| 长春市 | 二道区 |
| 长春市 | 双阳区 |
| 长春市 | 九台市 |
+--------+--------+
