--连接查询(多个表的关联查询)
  --内连接 inner join ..on.. 取交集
  --select * from 表A as a inner join 表B as b on a.x=b.x;
  --查询有能够对应班级的学生及班级信息
  select *from students inner join classes on students.class_id=classes.id;
  mysql> select *from students inner join classes on students.class_id=classes.id;
+----+--------+------+--------+--------+----------+------------+-----------+----+------------------+
| id | name   | age  | high   | gender | class_id | birth      | is_delete | id | name             |
+----+--------+------+--------+--------+----------+------------+-----------+----+------------------+
|  2 | kobe   |   38 | 196.00 | 男     |        1 | 1979-09-01 |          |  1 | 计算机科学与技术 |
|  3 | lbj    |   32 | 190.00 | 男     |        2 | 1988-08-08 |           |  2 | 一班             |
|  4 | durant |   30 | 198.00 | 男     |        3 | 1988-11-11 |           |  3 | 二班             |
|  5 | cnn    |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           |  1 | 计算机科学与技术 |
|  6 | allen  |   40 | 196.00 | 女     |        2 | 1999-10-10 |           |  2 | 一班             |
|  7 | 崔天凯 |   70 | 179.00 | 男     |        1 | 1950-01-10 |           |  1 | 计算机科学与技术 |
| 12 | 崔楠楠 |   20 | 160.00 | 女     |        1 | 2000-01-01 |           |  1 | 计算机科学与技术 |
+----+--------+------+--------+--------+----------+------------+-----------+----+------------------+

mysql> select *from students;
+----+------------+------+--------+--------+----------+------------+-----------+
| id | name       | age  | high   | gender | class_id | birth      | is_delete |
+----+------------+------+--------+--------+----------+------------+-----------+
|  2 | kobe       |   38 | 196.00 | 男     |        1 | 1979-09-01 |          |
|  3 | lbj        |   32 | 190.00 | 男     |        2 | 1988-08-08 |           |
|  4 | durant     |   30 | 198.00 | 男     |        3 | 1988-11-11 |           |
|  5 | cnn        |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           |
|  6 | allen      |   40 | 196.00 | 女     |        2 | 1999-10-10 |           |
|  7 | 崔天凯     |   70 | 179.00 | 男     |        1 | 1950-01-10 |           |
|  8 | 崔永元     |   18 |   NULL | 保密   |     NULL | 2000-01-01 |           |
|  9 | 崔楠楠     |   18 | 160.00 | 女     |     NULL | 2000-01-01 |           |
| 10 | 崔峰       |   18 |   NULL | 保密   |     NULL | 2000-01-01 |           |
| 11 | 崔永元     |   18 |   NULL | 保密   |     NULL | 2000-01-01 |           |
| 12 | 崔楠楠     |   20 | 160.00 | 女     |        1 | 2000-01-01 |           |
+----+------------+------+--------+--------+----------+------------+-----------+
--按要求显示姓名、班级
select students.*,classes.name from students inner join classes on students.class_id=classes.id;
mysql> select students.*,classes.name from students inner join classes on students.class_id=classes.id;
+----+--------+------+--------+--------+----------+------------+-----------+------------------+
| id | name   | age  | high   | gender | class_id | birth      | is_delete | name             |
+----+--------+------+--------+--------+----------+------------+-----------+------------------+
|  2 | kobe   |   38 | 196.00 | 男     |        1 | 1979-09-01 |          | 计算机科学与技术 |
|  3 | lbj    |   32 | 190.00 | 男     |        2 | 1988-08-08 |           | 一班             |
|  4 | durant |   30 | 198.00 | 男     |        3 | 1988-11-11 |           | 二班             |
|  5 | cnn    |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           | 计算机科学与技术 |
|  6 | allen  |   40 | 196.00 | 女     |        2 | 1999-10-10 |           | 一班             |
|  7 | 崔天凯 |   70 | 179.00 | 男     |        1 | 1950-01-10 |           | 计算机科学与技术 |
| 12 | 崔楠楠 |   20 | 160.00 | 女     |        1 | 2000-01-01 |           | 计算机科学与技术 |
+----+--------+------+--------+--------+----------+------------+-----------+------------------+

mysql> select students.name,classes.name from students inner join classes on students.class_id=classes.id;
+--------+------------------+
| name   | name             |
+--------+------------------+
| kobe   | 计算机科学与技术 |
| lbj    | 一班             |
| durant | 二班             |
| cnn    | 计算机科学与技术 |
| allen  | 一班             |
| 崔天凯 | 计算机科学与技术 |
| 崔楠楠 | 计算机科学与技术 |
+--------+------------------+
--给数据表取别名
select s.name,c.name from students as s inner join classes as c on s.class_id=c.id;
mysql> select s.name,c.name from students as s inner join classes as c on s.class_id=c.id;
+--------+------------------+
| name   | name             |
+--------+------------------+
| kobe   | 计算机科学与技术 |
| lbj    | 一班             |
| durant | 二班             |
| cnn    | 计算机科学与技术 |
| allen  | 一班             |
| 崔天凯 | 计算机科学与技术 |
| 崔楠楠 | 计算机科学与技术 |
+--------+------------------+
--查询 有能够对应班级的学生以及班级信息,显示学生的所有信息,只显示班级名称
select s.*,c.name from students as s inner join classes as c on s.class_id=c.id;
--在以上查询中,将班级名字放在第一列
select c.name,s.* from students as s inner join classes as c on s.class_id=c.id;
mysql> select c.name,s.* from students as s inner join classes as c on s.class_id=c.id;
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| name             | id | name   | age  | high   | gender | class_id | birth      | is_delete |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| 计算机科学与技术 |  2 | kobe   |   38 | 196.00 | 男     |        1 | 1979-09-01 |          |
| 一班             |  3 | lbj    |   32 | 190.00 | 男     |        2 | 1988-08-08 |           |
| 二班             |  4 | durant |   30 | 198.00 | 男     |        3 | 1988-11-11 |           |
| 计算机科学与技术 |  5 | cnn    |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           |
| 一班             |  6 | allen  |   40 | 196.00 | 女     |        2 | 1999-10-10 |           |
| 计算机科学与技术 |  7 | 崔天凯 |   70 | 179.00 | 男     |        1 | 1950-01-10 |           |
| 计算机科学与技术 | 12 | 崔楠楠 |   20 | 160.00 | 女     |        1 | 2000-01-01 |           |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
--查询 有能够对应班级的学生以及班级信息,按照班级进行排序
select c.name,s.* from students as s inner join classes as c on s.class_id=c.id order by c.name;
mysql> select c.name,s.* from students as s inner join classes as c on s.class_id=c.id order by c.name;
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| name             | id | name   | age  | high   | gender | class_id | birth      | is_delete |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| 一班             |  6 | allen  |   40 | 196.00 | 女     |        2 | 1999-10-10 |           |
| 一班             |  3 | lbj    |   32 | 190.00 | 男     |        2 | 1988-08-08 |           |
| 二班             |  4 | durant |   30 | 198.00 | 男     |        3 | 1988-11-11 |           |
| 计算机科学与技术 | 12 | 崔楠楠 |   20 | 160.00 | 女     |        1 | 2000-01-01 |           |
| 计算机科学与技术 |  2 | kobe   |   38 | 196.00 | 男     |        1 | 1979-09-01 |          |
| 计算机科学与技术 |  7 | 崔天凯 |   70 | 179.00 | 男     |        1 | 1950-01-10 |           |
| 计算机科学与技术 |  5 | cnn    |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
--当是同一个班级的时候,按照学生的id进行从小到大排序
select c.name,s.* from students as s inner join classes as c on s.class_id=c.id order by c.name,s.id asc;
mysql> select c.name,s.* from students as s inner join classes as c on s.class_id=c.id order by c.name,s.id asc
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| name             | id | name   | age  | high   | gender | class_id | birth      | is_delete |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
| 一班             |  3 | lbj    |   32 | 190.00 | 男     |        2 | 1988-08-08 |           |
| 一班             |  6 | allen  |   40 | 196.00 | 女     |        2 | 1999-10-10 |           |
| 二班             |  4 | durant |   30 | 198.00 | 男     |        3 | 1988-11-11 |           |
| 计算机科学与技术 |  2 | kobe   |   38 | 196.00 | 男     |        1 | 1979-09-01 |          |
| 计算机科学与技术 |  5 | cnn    |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           |
| 计算机科学与技术 |  7 | 崔天凯 |   70 | 179.00 | 男     |        1 | 1950-01-10 |           |
| 计算机科学与技术 | 12 | 崔楠楠 |   20 | 160.00 | 女     |        1 | 2000-01-01 |           |
+------------------+----+--------+------+--------+--------+----------+------------+-----------+
--左外连接..以左边表为基准,找不到为null..谁写在left join 左边,以谁为准.
select s.*,c.name from students as s left join classes as c on s.class_id=c.id;
  mysql> select s.*,c.name from students as s left join classes as c on s.class_id=c.id;
+----+------------+------+--------+--------+----------+------------+-----------+------------------+
| id | name       | age  | high   | gender | class_id | birth      | is_delete | name             |
+----+------------+------+--------+--------+----------+------------+-----------+------------------+
|  2 | kobe       |   38 | 196.00 | 男     |        1 | 1979-09-01 |          | 计算机科学与技术 |
|  5 | cnn        |   18 | 190.00 | 保密   |        1 | 1998-01-01 |           | 计算机科学与技术 |
|  7 | 崔天凯     |   70 | 179.00 | 男     |        1 | 1950-01-10 |           | 计算机科学与技术 |
| 12 | 崔楠楠     |   20 | 160.00 | 女     |        1 | 2000-01-01 |           | 计算机科学与技术 |
|  3 | lbj        |   32 | 190.00 | 男     |        2 | 1988-08-08 |           | 一班             |
|  6 | allen      |   40 | 196.00 | 女     |        2 | 1999-10-10 |           | 一班             |
|  4 | durant     |   30 | 198.00 | 男     |        3 | 1988-11-11 |           | 二班             |
|  8 | 崔永元     |   18 |   NULL | 保密   |     NULL | 2000-01-01 |           | NULL             |
|  9 | 崔楠楠     |   18 | 160.00 | 女     |     NULL | 2000-01-01 |           | NULL             |
+----+------------+------+--------+--------+----------+------------+-----------+------------------+

--查询没有对应班级的学生
select s.*,c.name from students as s left join classes as c on s.classes_id=c.id having c.name is null;